[{"__typename": "Bounty", "applicationCount": 0, "cycles": 200000, "deadline": "2023-02-18T00:00:00.000Z", "descriptionPreview": "Problem Description\nJife is an AI-powered webapp that provides new interior design ideas in seconds, based on Japanese interior design. With Jife, users can upload a photo of their room and get new interior ideas instantly. It will generate several interior design variations for free initially and then offer additional features with a paid subscription plan.\n\nFor free, the webapp allows users to upload a photo of their room and generate 5 interior design variations. The app allows users to generate for a variety of room types by default including living room, bedroom, bathroom, kitchen by default.\n\nThe webapp offers a monthly subscription plan for $29 that includes unlimited renders, the ability to keep originals and renders private, additional room types), virtual staging mode and a commercial usage license for 1 person. The subscription will unlock the dining room, study room, office, gaming room, outdoor, patio, genkan, toilets, attic.\n\nThe app also offers a professional subscriptio...", "id": 983, "slug": "jife-japanese-interi", "timeCreated": "2023-01-22T13:42:03.897Z", "title": "Jife: Japanese Interior Design Generator", "user": {"url": "/@GetInference"}, "url": "https://replit.com/bounties/@GetInference/jife-japanese-interi", "timestamp": "<t:1676678400:R>", "dollars": "$2000.00"}, {"__typename": "Bounty", "applicationCount": 2, "cycles": 2500, "deadline": "2023-02-05T00:00:00.000Z", "descriptionPreview": "Problem Description\nI'm starting a web game building coop. I'm looking for a lead programmer who has skills with node.js , game making, vanilla web tech, and networking like sockets.io\nThis bounty is basically an application to help start this coop. You will build a simple web game that runs on node, uses canvas in some way and sockets.io ( or just plain websockets )\n\nThe goal is not the repl. The goal is that if you successfully create this game you demonstrate your desire to join a new web game making coop here on Replit.  I have many plans and not enough time. I need folks who I can depend on to create games and build fun stuff. We can work out on a task basis getting compensated in cycles.\n\nAcceptance Criteria\nBe specific about what you want in the solution here.\n\nThis is a repl-based \"resume\" where you show off your Node.js + sockets + web dev + game making skills. Build any kind of game you like. Make it modest, but COMPLETE. Not a tech demo. A full, simple, web based node.js ser...", "id": 984, "slug": "join-a-game-making-c", "timeCreated": "2023-01-22T18:36:01.387Z", "title": "Join a game making coop - make a web game as a 'resume' application ", "user": {"url": "/@triptych"}, "url": "https://replit.com/bounties/@triptych/join-a-game-making-c", "timestamp": "<t:1675555200:R>", "dollars": "$25.00"}, {"__typename": "Bounty", "applicationCount": 5, "cycles": 2000, "deadline": "2023-01-27T00:00:00.000Z", "descriptionPreview": "Problem Description\nTrying to find a stroller on Craigslist and get notified (by email, or text) whenever a new post was added\n\nAcceptance Criteria\nRunning code that executes the above, with an interface to change / set the following:\nEmail/s to send notification to\nLocation in Craigslist\nSearch line in Craigslist\nFrequency of refresh (e.g., every day, every 4 hours)\n\nCode must be tested on a random email prior to delivery.", "id": 986, "slug": "scrape-a-craigslist", "timeCreated": "2023-01-22T19:09:46.331Z", "title": "Scrape a craigslist page into a list and refresh every X hours; Notify via email when new items are added/posted", "user": {"url": "/@GOEA"}, "url": "https://replit.com/bounties/@GOEA/scrape-a-craigslist", "timestamp": "<t:1674777600:R>", "dollars": "$20.00"}, {"__typename": "Bounty", "applicationCount": 1, "cycles": 16600, "deadline": "2023-02-01T00:00:00.000Z", "descriptionPreview": "Problem Description\n\nThe Caribbean world series is about to start, with eight teams competing from eight different leagues. I need an interactive website that pulls in each player's stats during their respective winter ball season to reach the Caribbean world series and past statistics pulled from Baseball reference\n\nAcceptance Criteria\nA list of leagues and teams can be found here make sure to include all statistics for the team and individual players that is availble\n\nTechnical Details\nThis will be a standalone project, so any coding language and data storage solutions are acceptable, with clear guidelines on adding or refreshing data in the future.\n\nTimelines / Milestones\nThe target release is Feb 1st, if completed on 1/27 will add a 50% bonus.", "id": 988, "slug": "caribbean-world-seri", "timeCreated": "2023-01-23T02:16:17.293Z", "title": "Caribbean World Series interactive Player Dashboard", "user": {"url": "/@MicheasYimam"}, "url": "https://replit.com/bounties/@MicheasYimam/caribbean-world-seri", "timestamp": "<t:1675209600:R>", "dollars": "$166.00"}, {"__typename": "Bounty", "applicationCount": 2, "cycles": 100, "deadline": "2023-02-03T00:00:00.000Z", "descriptionPreview": "Problem Description:\nHey there Bounty Hunters! I want you to create an idea for, and also program, the next viral post to get on Trending! The competition is fierce so good luck!\n\nAcceptance Criteria:\nMust be reasonable, not trolling. (I will accept stupid, but only if it is a funny stupid.)\nIf it doesn't actually end up on Trending, that's fine. It does not need to get on Trending for me to accept it.", "id": 990, "slug": "the-next-viral-post", "timeCreated": "2023-01-23T05:47:07.867Z", "title": "The Next VIRAL Post to get on Trending", "user": {"url": "/@d31337"}, "url": "https://replit.com/bounties/@d31337/the-next-viral-post", "timestamp": "<t:1675382400:R>", "dollars": "$1.00"}]