[{"__typename": "Bounty", "applicationCount": 2, "cycles": 250, "deadline": "2023-02-15T00:00:00.000Z", "descriptionPreview": "I need to have a verification email be sent to someone whenever they sign-up for the first time.\n\nMust be in HTML, CSS, JS, preferably not Node.JS but if you have to you can.\nVerification code (number) or link is fine, preferably code though.", "id": 1348, "slug": "verification-email", "timeCreated": "2023-02-11T08:33:26.840Z", "title": "Verification email", "user": {"url": "/@MakayaHall"}, "url": "https://replit.com/bounties/@MakayaHall/verification-email", "timestamp": "<t:1676419200:R>", "dollars": "$2.50"}, {"__typename": "Bounty", "applicationCount": 0, "cycles": 10000, "deadline": "2023-02-25T00:00:00.000Z", "descriptionPreview": "Problem Description\nI'd like automated code (node.js for example) that leverages the ImmuatbleX SDK: https://docs.x.immutable.com/docs/sdks/#core--wallet-sdk\nto retrieve the price of an NFT, places an order to purchase that token utilizing a metamask  wallet, and then lists an order to sell the token.\n\nAcceptance Criteria\nGiven a specific Gods Unchained NFT - I should be able to run the code so that the lowest available purchase price of the NFT is taken via Ethereum from a provided metamask wallet, then the purchased token is listed for sale via Gods tokens at a 5% increase from the purchase price.", "id": 1349, "slug": "leverage-imutablex-s", "timeCreated": "2023-02-11T18:49:42.953Z", "title": "Leverage ImutableX SDK to automate NFT purchasing / selling", "user": {"url": "/@AustinHayes2"}, "url": "https://replit.com/bounties/@AustinHayes2/leverage-imutablex-s", "timestamp": "<t:1677283200:R>", "dollars": "$100.00"}, {"__typename": "Bounty", "applicationCount": 2, "cycles": 10000, "deadline": "2023-02-15T00:00:00.000Z", "descriptionPreview": "Problem Description\n\nI would like a Python program which takes historical daily stock index data (example, the S&P 500 daily closing price) and identifies bull market peak dates, trough dates, peak values, trough values, percent loss (for bear markets), percent gains (for bull markets), and number of days of bull and bear market duration.  See the link below to economist Ed Yardeni's data on bull and bear markets for the S&P 500 for an indication of desired output that could be applied to other stock market indexes as well.\n\nAcceptance Criteria\n\nPython code which can deliver output that replicates  Yardeni's Tables 1 and 2 will be acceptable, so long as it is based on a method to identify bull market peaks and bear market troughs in a manner that could be applied to other stock market indexes.\n\nTechnical Details\nThe program should output Bull Market and Bear Market summary tables of the type found on economist Ed Yardeni's website at: https://www.yardeni.com/pub/sp500corrbeartables.pdf...", "id": 1350, "slug": "identify-bull-and-be", "timeCreated": "2023-02-11T19:36:17.111Z", "title": "Identify Bull and Bear Markets", "user": {"url": "/@GenuineSkill"}, "url": "https://replit.com/bounties/@GenuineSkill/identify-bull-and-be", "timestamp": "<t:1676419200:R>", "dollars": "$100.00"}, {"__typename": "Bounty", "applicationCount": 2, "cycles": 500, "deadline": "2023-02-15T00:00:00.000Z", "descriptionPreview": "Problem Description\n\nThere's a working script that receives a youtube link as input, extracts audio file, transcribes and diarizes it. I'd like you to simplify the script and receive the audio file as input instead of the youtube link.\n\nAcceptance Criteria\nMust work with a sample audio link as an input.\n\nTechnical Details\nIn the end, the input should be audiourlinstead of youtubeurl. Please remove any unused function (like the youtube stuff).\n\nLink to Project\nhttps://github.com/lucataco/serverless-template-whisper-speaker-diarization-largev2/blob/e0479e50fe6eaea0d56c158e6d92364e9d99ea2b/app.py#L53", "id": 1351, "slug": "simplify-a-python-sc", "timeCreated": "2023-02-11T20:00:41.164Z", "title": "Simplify a python script that currently receives a YT link and extracts audio to receive an audio input.", "user": {"url": "/@gporto"}, "url": "https://replit.com/bounties/@gporto/simplify-a-python-sc", "timestamp": "<t:1676419200:R>", "dollars": "$5.00"}, {"__typename": "Bounty", "applicationCount": 1, "cycles": 2500, "deadline": "2023-02-15T00:00:00.000Z", "descriptionPreview": "Problem Description\n\nThe search form is not working properly (https://staging2.legismusic.com/blog/) sometimes when I search for a query (for example 'facebook') it shows an error.\n\nThe Avada team (our Wordpress theme) told me is an issue with Polylang and they told me to deactivate the plugin or just change some options, but I cannot do any of those things: polylang is essential to our site and its configured the way it should be. So I want to know if there's a way to fix this.\n\nRelated to that, the search results -when they work- show results in the 3 languages, instead of the one that is being searched only.\n\nAcceptance Criteria\n\nWe would be happy if the bug is fixed :)\nThis page is our staging site (https://staging2.legismusic.com/) but the real one is https://legismusic.com/", "id": 1352, "slug": "error-on-search-word", "timeCreated": "2023-02-11T20:37:40.807Z", "title": "Error on search (Wordpress Site)", "user": {"url": "/@pablolon"}, "url": "https://replit.com/bounties/@pablolon/error-on-search-word", "timestamp": "<t:1676419200:R>", "dollars": "$25.00"}]